#pragma once

//===============================================
//	前方宣言
//===============================================
struct BeatData;
class SoflanManager;
class BaseMusicInfo;

/********************************************/
//	ソフラン管理クラス
/********************************************/
class BeatManager
{
public:
	//===============================================
	//	コンストラクタ・デストラクタ
	//===============================================
	BeatManager();
	~BeatManager();

	//===============================================
	//	初期化・解放
	//===============================================
	void Initialize(SoflanManager *pSoflanMgr);

	//===============================================
	//	更新
	//===============================================
	bool Update(DWORD dwCurrentPosition);

	//===============================================
	//	アクセサ
	//===============================================
	void Set(BaseMusicInfo *info);
	BeatData *GetBeatData();

private:
	void Clear();	// バッファ解放

	//===============================================
	//	メンバ変数
	//===============================================
	SoflanManager *m_pSoflanMgr;		// ソフラン管理を指し示す
	UINT m_iNumBeats;
	BeatData *m_Beats;
	UINT m_iBeatStep;
};