#pragma once

//===============================================
//	前方宣言
//===============================================
struct SoflanData;
class BaseMusicInfo;

/********************************************/
//	ソフラン管理クラス
/********************************************/
class SoflanManager
{
public:
	//===============================================
	//	初期化・解放
	//===============================================
	SoflanManager();
	~SoflanManager();

	//===============================================
	//	更新
	//===============================================
	bool Update(DWORD dwCurrentPosition);

	//===============================================
	//	アクセサ
	//===============================================
	float GetBPM();
	void Set(BaseMusicInfo *info);
	SoflanData *GetSoflans() { return m_Soflans; }

private:
	//===============================================
	//	メンバ変数
	//===============================================
	UINT m_iNumSoflans;
	SoflanData *m_Soflans;
	UINT m_iSoflanStep;
};